AchimPieters/esp32-smart-connect-plug/main/esp32-lcm.c
/**
   Copyright 2025 Achim Pieters | StudioPieters®

   Permission is hereby granted, free of charge, to any person obtaining a copy
   of this software and associated documentation files (the "Software"), to deal
   in the Software without restriction, including without limitation the rights
   to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
   copies of the Software, and to permit persons to whom the Software is
   furnished to do so, subject to the following conditions:

   The above copyright notice and this permission notice shall be included in all
   copies or substantial portions of the Software.

   THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
   IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
   FITNESS FOR A PARTICULAR PURPOSE AND NON INFRINGEMENT. IN NO EVENT SHALL THE
   AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY,
   WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
   CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.

   for more information visit https://www.studiopieters.nl
 **/
 
#include <string.h>
#include <stdbool.h>
#include <stddef.h>
#include <stdint.h>
#include <stdlib.h>
#include <inttypes.h>
#include <stdio.h>

#include <freertos/FreeRTOS.h>
#include <freertos/task.h>

#include <esp_event.h>
#include <esp_netif.h>
#include <esp_wifi.h>
#include <esp_log.h>
#include <esp_system.h>
#include <esp_ota_ops.h>
#include <esp_app_desc.h>
#include <esp_partition.h>
#include <esp_sleep.h>
#include <esp_timer.h>
#include <mdns.h>
#include <nvs.h>
#include <nvs_flash.h>

#include <homekit/homekit.h>
#include <homekit/characteristics.h>

#include "esp32-lcm.h"

static const char *WIFI_TAG = "WIFI";
static const char *LIFECYCLE_TAG = "LIFECYCLE";

#define WIFI_CHECK(call) do { \
    esp_err_t __wifi_err = (call); \
    if (__wifi_err != ESP_OK) { \
        ESP_LOGE(WIFI_TAG, "Error: %s", esp_err_to_name(__wifi_err)); \
        return __wifi_err; \
    } \
} while (0)

static void (*s_wifi_on_ready_cb)(void) = NULL;
static bool s_wifi_started = false;
static esp_netif_t *s_wifi_netif = NULL;

static const uint32_t k_post_reset_magic = 0xC0DEC0DE;
#ifndef CONFIG_LCM_RESTART_COUNTER_TIMEOUT_MS
#define CONFIG_LCM_RESTART_COUNTER_TIMEOUT_MS 5000
#endif

#if CONFIG_LCM_RESTART_COUNTER_TIMEOUT_MS <= 0
#error "CONFIG_LCM_RESTART_COUNTER_TIMEOUT_MS must be a positive value"
#endif

static const uint64_t k_restart_counter_timeout_us =
    ((uint64_t)CONFIG_LCM_RESTART_COUNTER_TIMEOUT_MS) * 1000ULL;
static const uint64_t k_restart_counter_timeout_ms =
    k_restart_counter_timeout_us / 1000ULL;
static const char *k_restart_counter_namespace = "lcm";
static const char *k_restart_counter_key = "restart_count";

RTC_DATA_ATTR static struct {
    uint32_t magic;
    uint32_t reason;
    uint32_t restart_count;
} s_post_reset_state;

static char s_fw_revision[LIFECYCLE_FW_REVISION_MAX_LEN];
static bool s_fw_revision_initialized = false;
static esp_timer_handle_t s_restart_counter_timer = NULL;
static bool s_nvs_initialized = false;

void wifi_config_shutdown(void) __attribute__((weak));

static void lifecycle_log_step(const char *step);
static void lifecycle_mark_post_reset(lifecycle_post_reset_reason_t reason);
static lifecycle_post_reset_reason_t lifecycle_peek_post_reset_reason(void);
static void lifecycle_clear_post_reset_state(void);
static uint32_t lifecycle_increment_restart_counter(void);
static void lifecycle_reset_restart_counter(void);
static void lifecycle_restart_counter_timeout(void *arg);
static void lifecycle_schedule_restart_counter_timeout(const char *log_tag);
static void lifecycle_shutdown_homekit(bool reset_store);
static void lifecycle_stop_provisioning_servers(void);
static void lifecycle_perform_common_shutdown(bool reset_homekit_store);
static esp_err_t load_restart_counter_from_nvs(uint32_t *out_value, const char *log_tag);
static esp_err_t save_restart_counter_to_nvs(uint32_t value, const char *log_tag);
static esp_err_t lifecycle_ensure_nvs_initialized(const char *log_tag);

static esp_err_t nvs_load_wifi(char **out_ssid, char **out_pass) {
    esp_err_t init_err = lifecycle_ensure_nvs_initialized(WIFI_TAG);
    if (init_err != ESP_OK) {
        return init_err;
    }

    nvs_handle_t handle;
    esp_err_t err = nvs_open("wifi_cfg", NVS_READONLY, &handle);
    if (err != ESP_OK) {
        ESP_LOGE(WIFI_TAG, "NVS open failed for namespace 'wifi_cfg': %s", esp_err_to_name(err));
        return err;
    }

    size_t len_ssid = 0;
    size_t len_pass = 0;
    err = nvs_get_str(handle, "wifi_ssid", NULL, &len_ssid);
    if (err != ESP_OK) {
        ESP_LOGE(WIFI_TAG, "NVS key 'wifi_ssid' not found: %s", esp_err_to_name(err));
        nvs_close(handle);
        return err;
    }

    err = nvs_get_str(handle, "wifi_password", NULL, &len_pass);
    if (err == ESP_ERR_NVS_NOT_FOUND) {
        len_pass = 1;
    } else if (err != ESP_OK) {
        ESP_LOGE(WIFI_TAG, "NVS key 'wifi_password' read error: %s", esp_err_to_name(err));
        nvs_close(handle);
        return err;
    }

    char *ssid = (char *)malloc(len_ssid);
    char *pass = (char *)malloc(len_pass);
    if (ssid == NULL || pass == NULL) {
        free(ssid);
        free(pass);
        nvs_close(handle);
        return ESP_ERR_NO_MEM;
    }

    err = nvs_get_str(handle, "wifi_ssid", ssid, &len_ssid);
    if (err != ESP_OK) {
        ESP_LOGE(WIFI_TAG, "Failed to read wifi_ssid: %s", esp_err_to_name(err));
        free(ssid);
        free(pass);
        nvs_close(handle);
        return err;
    }

    if (len_pass == 1) {
        pass[0] = '\0';
    } else {
        err = nvs_get_str(handle, "wifi_password", pass, &len_pass);
        if (err != ESP_OK) {
            ESP_LOGE(WIFI_TAG, "Failed to read wifi_password: %s", esp_err_to_name(err));
            free(ssid);
            free(pass);
            nvs_close(handle);
            return err;
        }
    }

    nvs_close(handle);
    *out_ssid = ssid;
    *out_pass = pass;
    return ESP_OK;
}

static void wifi_event_handler(void *arg, esp_event_base_t base, int32_t id, void *data) {
    if (base == WIFI_EVENT) {
        switch (id) {
            case WIFI_EVENT_STA_START:
                ESP_LOGI(WIFI_TAG, "STA start -> connect");
                esp_wifi_connect();
                break;
            case WIFI_EVENT_STA_DISCONNECTED: {
                wifi_event_sta_disconnected_t *disc = (wifi_event_sta_disconnected_t *)data;
                ESP_LOGW(WIFI_TAG, "Disconnected (reason=%d). Reconnecting...", disc ? disc->reason : -1);
                esp_wifi_connect();
                break;
            }
            default:
                break;
        }
    } else if (base == IP_EVENT && id == IP_EVENT_STA_GOT_IP) {
        ip_event_got_ip_t *event = (ip_event_got_ip_t *)data;
        ESP_LOGI(WIFI_TAG, "Got IP: " IPSTR, IP2STR(&event->ip_info.ip));
        if (s_wifi_on_ready_cb != NULL) {
            s_wifi_on_ready_cb();
        }
    }
}

static void lifecycle_log_step(const char *step) {
    if (step == NULL) {
        return;
    }
    ESP_LOGI(LIFECYCLE_TAG, "[lifecycle] %s", step);
}

static void lifecycle_mark_post_reset(lifecycle_post_reset_reason_t reason) {
    s_post_reset_state.magic = k_post_reset_magic;
    s_post_reset_state.reason = (uint32_t)reason;
}

static lifecycle_post_reset_reason_t lifecycle_peek_post_reset_reason(void) {
    if (s_post_reset_state.magic != k_post_reset_magic) {
        return LIFECYCLE_POST_RESET_NONE;
    }

    lifecycle_post_reset_reason_t reason =
            (lifecycle_post_reset_reason_t)s_post_reset_state.reason;
    if (reason < LIFECYCLE_POST_RESET_NONE ||
            reason > LIFECYCLE_POST_RESET_REASON_UPDATE) {
        return LIFECYCLE_POST_RESET_NONE;
    }

    return reason;
}

static void lifecycle_clear_post_reset_state(void) {
    s_post_reset_state.magic = 0;
    s_post_reset_state.reason = LIFECYCLE_POST_RESET_NONE;
}

static esp_err_t lifecycle_ensure_nvs_initialized(const char *log_tag) {
    if (s_nvs_initialized) {
        return ESP_OK;
    }

    const char *tag = (log_tag != NULL) ? log_tag : LIFECYCLE_TAG;

    esp_err_t ret = nvs_flash_init();
    if (ret == ESP_ERR_NVS_NO_FREE_PAGES || ret == ESP_ERR_NVS_NEW_VERSION_FOUND) {
        ESP_LOGW(tag,
                 "[lifecycle] NVS init issue (%s); attempting erase",
                 esp_err_to_name(ret));
        esp_err_t erase_err = nvs_flash_erase();
        if (erase_err != ESP_OK) {
            ESP_LOGE(tag,
                     "[lifecycle] Failed to erase NVS while recovering init: %s",
                     esp_err_to_name(erase_err));
            return erase_err;
        }
        ret = nvs_flash_init();
    }

    if (ret != ESP_OK) {
        ESP_LOGE(tag,
                 "[lifecycle] Failed to initialise NVS: %s",
                 esp_err_to_name(ret));
        return ret;
    }

    s_nvs_initialized = true;
    return ESP_OK;
}

static esp_err_t load_restart_counter_from_nvs(uint32_t *out_value, const char *log_tag) {
    if (out_value == NULL) {
        return ESP_ERR_INVALID_ARG;
    }

    uint32_t value = 0;
    nvs_handle_t handle;
    const char *tag = (log_tag != NULL) ? log_tag : LIFECYCLE_TAG;

