AchimPieters/esp32-smart-connect-plug/main/esp32-lcm.c
    esp_err_t init_err = lifecycle_ensure_nvs_initialized(tag);
    if (init_err != ESP_OK) {
        *out_value = 0;
        return init_err;
    }

    esp_err_t err = nvs_open(k_restart_counter_namespace, NVS_READWRITE, &handle);
    if (err != ESP_OK) {
        ESP_LOGE(tag,
                 "[lifecycle] Failed to open NVS namespace '%s' for restart counter: %s",
                 k_restart_counter_namespace,
                 esp_err_to_name(err));
        *out_value = 0;
        return err;
    }

    err = nvs_get_u32(handle, k_restart_counter_key, &value);
    if (err == ESP_ERR_NVS_NOT_FOUND) {
        value = 0;
        err = ESP_OK;
    } else if (err != ESP_OK) {
        ESP_LOGE(tag,
                 "[lifecycle] Failed to read restart counter from NVS: %s",
                 esp_err_to_name(err));
    }

    nvs_close(handle);
    *out_value = value;
    return err;
}

static esp_err_t save_restart_counter_to_nvs(uint32_t value, const char *log_tag) {
    const char *tag = (log_tag != NULL) ? log_tag : LIFECYCLE_TAG;

    esp_err_t init_err = lifecycle_ensure_nvs_initialized(tag);
    if (init_err != ESP_OK) {
        return init_err;
    }

    nvs_handle_t handle;
    esp_err_t err = nvs_open(k_restart_counter_namespace, NVS_READWRITE, &handle);
    if (err != ESP_OK) {
        ESP_LOGE(tag,
                 "[lifecycle] Failed to open NVS namespace '%s' for restart counter: %s",
                 k_restart_counter_namespace,
                 esp_err_to_name(err));
        return err;
    }

    err = nvs_set_u32(handle, k_restart_counter_key, value);
    if (err != ESP_OK) {
        ESP_LOGE(tag,
                 "[lifecycle] Failed to store restart counter in NVS: %s",
                 esp_err_to_name(err));
        nvs_close(handle);
        return err;
    }

    esp_err_t commit_err = nvs_commit(handle);
    if (commit_err != ESP_OK) {
        ESP_LOGE(tag,
                 "[lifecycle] Failed to commit restart counter to NVS: %s",
                 esp_err_to_name(commit_err));
        err = commit_err;
    }

    nvs_close(handle);
    return err;
}

static uint32_t lifecycle_increment_restart_counter(void) {
    uint32_t previous = s_post_reset_state.restart_count;
    if (s_post_reset_state.restart_count == UINT32_MAX) {
        s_post_reset_state.restart_count = 0;
    }

    s_post_reset_state.restart_count++;
    ESP_LOGD(LIFECYCLE_TAG,
            "[lifecycle] restart counter incremented (previous=%" PRIu32 ", current=%" PRIu32 ")",
            previous,
            s_post_reset_state.restart_count);
    return s_post_reset_state.restart_count;
}

static void lifecycle_reset_restart_counter(void) {
    if (s_post_reset_state.restart_count != 0U) {
        ESP_LOGD(LIFECYCLE_TAG, "[lifecycle] restart counter reset");
    }
    s_post_reset_state.restart_count = 0;

    esp_err_t err = save_restart_counter_to_nvs(0, NULL);
    if (err != ESP_OK) {
        ESP_LOGW(LIFECYCLE_TAG,
                 "[lifecycle] Failed to reset restart counter in NVS: %s",
                 esp_err_to_name(err));
    }
}

static void lifecycle_restart_counter_timeout(void *arg) {
    const char *tag = (const char *)arg;
    if (tag == NULL) {
        tag = LIFECYCLE_TAG;
    }

    if (s_post_reset_state.restart_count != 0U) {
        ESP_LOGI(tag,
                "[lifecycle] No restart detected within %llu ms; clearing counter",
                (unsigned long long)k_restart_counter_timeout_ms);
    }

    lifecycle_reset_restart_counter();
}

static void lifecycle_schedule_restart_counter_timeout(const char *log_tag) {
    const char *tag = (log_tag != NULL) ? log_tag : LIFECYCLE_TAG;

    if (s_restart_counter_timer == NULL) {
        const esp_timer_create_args_t timer_args = {
            .callback = lifecycle_restart_counter_timeout,
            .arg = (void *)LIFECYCLE_TAG,
            .name = "restart_cnt_reset",
        };

        esp_err_t err = esp_timer_create(&timer_args, &s_restart_counter_timer);
        if (err != ESP_OK) {
            ESP_LOGE(tag,
                    "[lifecycle] Failed to create restart counter timer: %s",
                    esp_err_to_name(err));
            return;
        }
    }

    esp_err_t err = esp_timer_stop(s_restart_counter_timer);
    if (err != ESP_OK && err != ESP_ERR_INVALID_STATE) {
        ESP_LOGW(tag,
                "[lifecycle] Failed to stop restart counter timer: %s",
                esp_err_to_name(err));
    }

    err = esp_timer_start_once(s_restart_counter_timer, k_restart_counter_timeout_us);
    if (err != ESP_OK) {
        ESP_LOGE(tag,
                "[lifecycle] Failed to start restart counter timer: %s",
                esp_err_to_name(err));
        return;
    }

    ESP_LOGD(tag,
            "[lifecycle] Restart counter timeout armed for %llu ms",
            (unsigned long long)k_restart_counter_timeout_ms);
}

void lifecycle_log_post_reset_state(const char *log_tag) {
    const char *tag = (log_tag != NULL) ? log_tag : LIFECYCLE_TAG;
    uint32_t persisted_count = 0;
    esp_err_t load_err = load_restart_counter_from_nvs(&persisted_count, tag);
    if (load_err == ESP_OK) {
        if (persisted_count > s_post_reset_state.restart_count) {
            s_post_reset_state.restart_count = persisted_count;
        }
    } else {
        ESP_LOGW(tag,
                 "[lifecycle] Failed to load restart counter from NVS (err=%s); using RTC value",
                 esp_err_to_name(load_err));
    }

    uint32_t restart_count = lifecycle_increment_restart_counter();

    esp_err_t save_err = save_restart_counter_to_nvs(restart_count, tag);
    if (save_err != ESP_OK) {
        ESP_LOGW(tag,
                 "[lifecycle] Failed to persist restart counter to NVS (err=%s)",
                 esp_err_to_name(save_err));
    }

    ESP_LOGI(tag, "[lifecycle] consecutive_restart_count=%" PRIu32, restart_count);

    lifecycle_schedule_restart_counter_timeout(tag);

    if (restart_count >= 10U) {
        ESP_LOGW(tag, "[lifecycle] Detected 10 consecutive restarts; performing factory reset countdown");
        for (int i = 10; i >= 0; --i) {
            ESP_LOGW(tag, "[lifecycle] Factory reset in %d", i);
            vTaskDelay(pdMS_TO_TICKS(1000));
        }

        lifecycle_reset_restart_counter();
        lifecycle_factory_reset_and_reboot();
        return;
    }

