AchimPieters/esp32-smart-connect-plug/main/esp32-lcm.c
    lifecycle_post_reset_reason_t reason = lifecycle_peek_post_reset_reason();
    const char *reason_str = "none";

    switch (reason) {
        case LIFECYCLE_POST_RESET_NONE:
            reason_str = "none";
            break;
        case LIFECYCLE_POST_RESET_REASON_HOMEKIT:
            reason_str = "homekit";
            break;
        case LIFECYCLE_POST_RESET_REASON_FACTORY:
            reason_str = "factory";
            break;
        case LIFECYCLE_POST_RESET_REASON_UPDATE:
            reason_str = "update";
            break;
        default:
            reason_str = "unknown";
            break;
    }

    ESP_LOGI(tag, "[lifecycle] post_reset_flag=%s", reason_str);
    lifecycle_clear_post_reset_state();
}

static void lifecycle_shutdown_homekit(bool reset_store) {
    lifecycle_log_step("stop_homekit");
    ESP_LOGD(LIFECYCLE_TAG,
             "HomeKit stop requested; relying on network teardown for active sessions");

    lifecycle_log_step("wait_hap_clients");
    vTaskDelay(pdMS_TO_TICKS(100));

    lifecycle_log_step("stop_mdns");
    esp_err_t mdns_err = mdns_service_remove("_hap", "_tcp");
    if (mdns_err != ESP_OK && mdns_err != ESP_ERR_NOT_FOUND &&
            mdns_err != ESP_ERR_INVALID_STATE) {
        ESP_LOGW(LIFECYCLE_TAG, "Failed to remove mDNS service: %s",
                 esp_err_to_name(mdns_err));
    }

    mdns_free();

    if (reset_store) {
        lifecycle_log_step("reset_homekit_store");
        homekit_server_reset();
    }
}

static void lifecycle_stop_provisioning_servers(void) {
    if (wifi_config_shutdown) {
        lifecycle_log_step("stop_provisioning");
        wifi_config_shutdown();
    } else {
        ESP_LOGD(LIFECYCLE_TAG,
                 "No provisioning shutdown handler registered; skipping");
    }
}

static void lifecycle_perform_common_shutdown(bool reset_homekit_store) {
    lifecycle_shutdown_homekit(reset_homekit_store);
    lifecycle_stop_provisioning_servers();

    lifecycle_log_step("stop_wifi");
    esp_err_t stop_err = wifi_stop();
    if (stop_err != ESP_OK) {
        ESP_LOGW(LIFECYCLE_TAG, "wifi_stop failed: %s", esp_err_to_name(stop_err));
    }
}

esp_err_t wifi_start(void (*on_ready)(void)) {
    if (s_wifi_started) {
        s_wifi_on_ready_cb = on_ready;
        ESP_LOGI(WIFI_TAG, "WiFi already started");
        return ESP_OK;
    }

    char *ssid = NULL;
    char *pass = NULL;
    esp_err_t err = nvs_load_wifi(&ssid, &pass);
    if (err == ESP_ERR_NVS_NOT_FOUND) {
        ESP_LOGW(WIFI_TAG, "WiFi configuratie niet gevonden in NVS; provisioning vereist");
        return err;
    } else if (err != ESP_OK) {
        ESP_LOGE(WIFI_TAG, "Kon WiFi config niet laden uit NVS");
        return err;
    }

    bool pass_empty = (pass[0] == '\0');
    wifi_config_t wc = (wifi_config_t){ 0 };
    strncpy((char *)wc.sta.ssid, ssid, sizeof(wc.sta.ssid) - 1);
    strncpy((char *)wc.sta.password, pass, sizeof(wc.sta.password) - 1);
    free(ssid);
    free(pass);

    if (pass_empty) {
        wc.sta.threshold.authmode = WIFI_AUTH_OPEN;
    } else {
        wc.sta.threshold.authmode = WIFI_AUTH_WPA2_PSK;
    }

    err = esp_netif_init();
    if (err != ESP_OK && err != ESP_ERR_INVALID_STATE) {
        ESP_LOGE(WIFI_TAG, "Failed to init netif: %s", esp_err_to_name(err));
        return err;
    }
    err = esp_event_loop_create_default();
    if (err != ESP_OK && err != ESP_ERR_INVALID_STATE) {
        ESP_LOGE(WIFI_TAG, "Failed to create default event loop: %s", esp_err_to_name(err));
        return err;
    }
    if (s_wifi_netif == NULL) {
        s_wifi_netif = esp_netif_create_default_wifi_sta();
        if (s_wifi_netif == NULL) {
            ESP_LOGE(WIFI_TAG, "Failed to create default WiFi STA interface");
            return ESP_ERR_NO_MEM;
        }
    }

    WIFI_CHECK(esp_event_handler_register(WIFI_EVENT, ESP_EVENT_ANY_ID, &wifi_event_handler, NULL));
    WIFI_CHECK(esp_event_handler_register(IP_EVENT, IP_EVENT_STA_GOT_IP, &wifi_event_handler, NULL));

    wifi_init_config_t cfg = WIFI_INIT_CONFIG_DEFAULT();
    WIFI_CHECK(esp_wifi_init(&cfg));
    WIFI_CHECK(esp_wifi_set_storage(WIFI_STORAGE_RAM));
    WIFI_CHECK(esp_wifi_set_mode(WIFI_MODE_STA));

    WIFI_CHECK(esp_wifi_set_config(WIFI_IF_STA, &wc));
    WIFI_CHECK(esp_wifi_start());

    s_wifi_on_ready_cb = on_ready;
    s_wifi_started = true;

    ESP_LOGI(WIFI_TAG, "WiFi start klaar (STA). Verbinden...");
    return ESP_OK;
}

esp_err_t wifi_stop(void) {
    if (!s_wifi_started) {
        return ESP_OK;
    }

    ESP_LOGI(WIFI_TAG, "WiFi stoppen...");

    esp_err_t result = ESP_OK;

    esp_err_t disconnect_err = esp_wifi_disconnect();
    if (disconnect_err != ESP_OK && disconnect_err != ESP_ERR_WIFI_NOT_STARTED &&
            disconnect_err != ESP_ERR_WIFI_NOT_INIT) {
        ESP_LOGW(WIFI_TAG, "esp_wifi_disconnect failed: %s", esp_err_to_name(disconnect_err));
        if (result == ESP_OK) {
            result = disconnect_err;
        }
    }

    esp_err_t stop_err = esp_wifi_stop();
    if (stop_err != ESP_OK && stop_err != ESP_ERR_WIFI_NOT_INIT) {
        ESP_LOGW(WIFI_TAG, "esp_wifi_stop failed: %s", esp_err_to_name(stop_err));
        if (result == ESP_OK) {
            result = stop_err;
        }
    }

    esp_err_t unregister_wifi = esp_event_handler_unregister(WIFI_EVENT, ESP_EVENT_ANY_ID, &wifi_event_handler);
    if (unregister_wifi != ESP_OK && unregister_wifi != ESP_ERR_INVALID_STATE) {
        ESP_LOGW(WIFI_TAG, "Failed to unregister WiFi event handler: %s",
                 esp_err_to_name(unregister_wifi));
        if (result == ESP_OK) {
            result = unregister_wifi;
        }
    }

    esp_err_t unregister_ip = esp_event_handler_unregister(IP_EVENT, IP_EVENT_STA_GOT_IP, &wifi_event_handler);
    if (unregister_ip != ESP_OK && unregister_ip != ESP_ERR_INVALID_STATE) {
        ESP_LOGW(WIFI_TAG, "Failed to unregister IP event handler: %s",
                 esp_err_to_name(unregister_ip));
        if (result == ESP_OK) {
            result = unregister_ip;
        }
    }

    esp_err_t deinit_err = esp_wifi_deinit();
    if (deinit_err != ESP_OK && deinit_err != ESP_ERR_WIFI_NOT_INIT) {
        ESP_LOGW(WIFI_TAG, "esp_wifi_deinit failed: %s", esp_err_to_name(deinit_err));
        if (result == ESP_OK) {
            result = deinit_err;
        }
    }

    if (s_wifi_netif != NULL) {
        esp_netif_destroy(s_wifi_netif);
        s_wifi_netif = NULL;
    }

    s_wifi_started = false;
    s_wifi_on_ready_cb = NULL;

    ESP_LOGI(WIFI_TAG, "WiFi driver stopped");
    return result;
}

esp_err_t lifecycle_nvs_init(void) {
    return lifecycle_ensure_nvs_initialized(LIFECYCLE_TAG);
}

