AchimPieters/esp32-smart-connect-plug/main/esp32-lcm.c
esp_err_t lifecycle_init_firmware_revision(homekit_characteristic_t *revision,
                                           const char *fallback_version) {
    if (revision == NULL || fallback_version == NULL) {
        return ESP_ERR_INVALID_ARG;
    }

    const esp_app_desc_t *desc = esp_app_get_description();
    const char *current_version = fallback_version;
    if (desc && strlen(desc->version) > 0) {
        current_version = desc->version;
    }
    if (current_version == NULL || current_version[0] == '\0') {
        current_version = "0.0.0";
    }

    strlcpy(s_fw_revision, current_version, sizeof(s_fw_revision));
    s_fw_revision_initialized = true;

    esp_err_t status = ESP_OK;
    bool used_stored_value = false;

    esp_err_t init_err = lifecycle_ensure_nvs_initialized(LIFECYCLE_TAG);
    if (init_err != ESP_OK) {
        return init_err;
    }

    nvs_handle_t handle;
    esp_err_t err = nvs_open("fwcfg", NVS_READWRITE, &handle);
    if (err == ESP_OK) {
        size_t required = sizeof(s_fw_revision);
        err = nvs_get_str(handle, "installed_ver", s_fw_revision, &required);
        if (err == ESP_OK && s_fw_revision[0] != '\0') {
            used_stored_value = true;
        } else if (err == ESP_ERR_NVS_NOT_FOUND || s_fw_revision[0] == '\0') {
            strlcpy(s_fw_revision, current_version, sizeof(s_fw_revision));
            esp_err_t set_err = nvs_set_str(handle, "installed_ver", s_fw_revision);
            if (set_err != ESP_OK) {
                ESP_LOGW(LIFECYCLE_TAG, "Failed to store firmware revision: %s",
                         esp_err_to_name(set_err));
                status = set_err;
            } else {
                esp_err_t commit_err = nvs_commit(handle);
                if (commit_err != ESP_OK) {
                    ESP_LOGW(LIFECYCLE_TAG, "Commit of firmware revision failed: %s",
                             esp_err_to_name(commit_err));
                    status = commit_err;
                }
            }
        } else {
            ESP_LOGW(LIFECYCLE_TAG, "Reading stored firmware revision failed: %s",
                     esp_err_to_name(err));
            strlcpy(s_fw_revision, current_version, sizeof(s_fw_revision));
        }
        nvs_close(handle);
    } else {
        ESP_LOGW(LIFECYCLE_TAG, "Unable to open fwcfg namespace: %s", esp_err_to_name(err));
        status = err;
    }

    revision->value.string_value = s_fw_revision;
    revision->value.is_static = true;

    ESP_LOGI(LIFECYCLE_TAG, "Firmware revision set to %s (%s)",
             s_fw_revision, used_stored_value ? "stored" : "runtime");

    return status;
}

const char *lifecycle_get_firmware_revision_string(void) {
    if (s_fw_revision_initialized && s_fw_revision[0] != '\0') {
        return s_fw_revision;
    }

    const esp_app_desc_t *desc = esp_app_get_description();
    if (desc && desc->version[0] != '\0') {
        return desc->version;
    }

    return NULL;
}

void lifecycle_handle_ota_trigger(homekit_characteristic_t *characteristic,
                                  const homekit_value_t value) {
    if (characteristic == NULL) {
        return;
    }
    if (value.format != homekit_format_bool) {
        ESP_LOGW(LIFECYCLE_TAG, "Invalid OTA trigger format: %d", value.format);
        return;
    }

    bool requested = value.bool_value;
    characteristic->value.bool_value = false;
    homekit_characteristic_notify(characteristic, HOMEKIT_BOOL(characteristic->value.bool_value));

    if (requested) {
        ESP_LOGI(LIFECYCLE_TAG, "HomeKit requested firmware update");
        lifecycle_request_update_and_reboot();
    }
}

esp_err_t lifecycle_configure_homekit(homekit_characteristic_t *revision,
                                      homekit_characteristic_t *ota_trigger,
                                      const char *log_tag) {
    if (revision == NULL) {
        return ESP_ERR_INVALID_ARG;
    }

    const char *tag = (log_tag != NULL) ? log_tag : LIFECYCLE_TAG;
    const char *fallback_version = LIFECYCLE_DEFAULT_FW_VERSION;

    esp_err_t rev_err = lifecycle_init_firmware_revision(revision, fallback_version);
    const char *resolved_version = lifecycle_get_firmware_revision_string();
    if (resolved_version != NULL && resolved_version[0] != '\0') {
        ESP_LOGI(tag, "Lifecycle Manager firmware version (NVS): %s", resolved_version);
    } else {
        ESP_LOGW(tag,
                 "Lifecycle Manager firmware version not found in NVS, using fallback: %s",
                 fallback_version);
    }

    if (rev_err != ESP_OK) {
        ESP_LOGW(tag, "Firmware revision init failed: %s", esp_err_to_name(rev_err));
    }

    if (ota_trigger != NULL) {
        ota_trigger->setter = NULL;
        ota_trigger->setter_ex = lifecycle_handle_ota_trigger;
        ota_trigger->value.bool_value = false;
    }

    return rev_err;
}

void lifecycle_request_update_and_reboot(void) {
    ESP_LOGI(LIFECYCLE_TAG, "Requesting Lifecycle Manager update and reboot");

    nvs_handle_t handle;
    esp_err_t err = nvs_open("lcm", NVS_READWRITE, &handle);
    if (err != ESP_OK) {
        ESP_LOGE(LIFECYCLE_TAG, "Failed to open NVS namespace 'lcm': %s", esp_err_to_name(err));
    } else {
        err = nvs_set_u8(handle, "do_update", 1);
        if (err != ESP_OK) {
            ESP_LOGE(LIFECYCLE_TAG, "Failed to set do_update flag: %s", esp_err_to_name(err));
        } else {
            err = nvs_commit(handle);
            if (err != ESP_OK) {
                ESP_LOGE(LIFECYCLE_TAG, "Failed to commit update flag: %s", esp_err_to_name(err));
            }
        }
        nvs_close(handle);
    }

    bool factory_boot_selected = false;

    const esp_partition_t *factory = esp_partition_find_first(
            ESP_PARTITION_TYPE_APP, ESP_PARTITION_SUBTYPE_APP_FACTORY, NULL);
    if (factory == NULL) {
        ESP_LOGE(LIFECYCLE_TAG, "Factory partition not found, rebooting to current app");
    } else {
        lifecycle_log_step("set_boot=factory");
        err = esp_ota_set_boot_partition(factory);
        if (err != ESP_OK) {
            ESP_LOGE(LIFECYCLE_TAG, "Failed to set factory partition for boot: %s", esp_err_to_name(err));
        } else {
            lifecycle_log_step("set_post_reset_flag=update");
            lifecycle_mark_post_reset(LIFECYCLE_POST_RESET_REASON_UPDATE);
            factory_boot_selected = true;
        }
    }

    lifecycle_perform_common_shutdown(false);

    lifecycle_log_step("delay_before_reset");
    vTaskDelay(pdMS_TO_TICKS(100));

    lifecycle_log_step("reboot");
    if (factory_boot_selected) {
        ESP_LOGI(LIFECYCLE_TAG, "Rebooting into factory partition for update");
    } else {
        ESP_LOGI(LIFECYCLE_TAG, "Rebooting to continue update workflow");
    }
    esp_restart();
}

void lifecycle_reset_homekit_and_reboot(void) {
    ESP_LOGI(LIFECYCLE_TAG, "Resetting HomeKit state and rebooting");
    const esp_partition_t *running = esp_ota_get_running_partition();
    if (running != NULL) {
        lifecycle_log_step("set_boot=current");
        esp_err_t err = esp_ota_set_boot_partition(running);
        if (err != ESP_OK) {
            ESP_LOGW(LIFECYCLE_TAG, "Failed to re-select running partition: %s",
                     esp_err_to_name(err));
        }
    }

    lifecycle_log_step("set_post_reset_flag=homekit");
    lifecycle_mark_post_reset(LIFECYCLE_POST_RESET_REASON_HOMEKIT);

