AchimPieters/esp32-smart-connect-plug/main/esp32-lcm.c
    lifecycle_perform_common_shutdown(true);

    lifecycle_log_step("delay_before_reset");
    vTaskDelay(pdMS_TO_TICKS(100));

    lifecycle_log_step("reboot");
    esp_restart();
}

static void erase_wifi_credentials(void) {
    ESP_LOGI(LIFECYCLE_TAG, "Clearing Wi-Fi credentials from NVS namespace 'wifi_cfg'");

    esp_err_t init_err = lifecycle_ensure_nvs_initialized(LIFECYCLE_TAG);
    if (init_err != ESP_OK) {
        ESP_LOGW(LIFECYCLE_TAG,
                 "Failed to initialise NVS while clearing Wi-Fi credentials: %s",
                 esp_err_to_name(init_err));
        return;
    }

    nvs_handle_t handle;
    esp_err_t err = nvs_open("wifi_cfg", NVS_READWRITE, &handle);
    if (err != ESP_OK) {
        ESP_LOGW(LIFECYCLE_TAG, "Failed to open wifi_cfg namespace: %s", esp_err_to_name(err));
        return;
    }

    esp_err_t erase_err = nvs_erase_key(handle, "wifi_ssid");
    if (erase_err != ESP_OK && erase_err != ESP_ERR_NVS_NOT_FOUND) {
        ESP_LOGW(LIFECYCLE_TAG, "Failed to erase wifi_ssid: %s", esp_err_to_name(erase_err));
    }

    erase_err = nvs_erase_key(handle, "wifi_password");
    if (erase_err != ESP_OK && erase_err != ESP_ERR_NVS_NOT_FOUND) {
        ESP_LOGW(LIFECYCLE_TAG, "Failed to erase wifi_password: %s", esp_err_to_name(erase_err));
    }

    err = nvs_commit(handle);
    if (err != ESP_OK) {
        ESP_LOGW(LIFECYCLE_TAG, "Failed to commit Wi-Fi credential erase: %s", esp_err_to_name(err));
    }

    nvs_close(handle);
}

static void erase_nvs_partition(void) {
    lifecycle_log_step("erase_nvs_partition");

    esp_err_t err = nvs_flash_deinit();
    if (err != ESP_OK && err != ESP_ERR_NVS_NOT_INITIALIZED) {
        ESP_LOGW(LIFECYCLE_TAG, "nvs_flash_deinit failed: %s", esp_err_to_name(err));
    }

    s_nvs_initialized = false;

    err = nvs_flash_erase();
    if (err != ESP_OK) {
        ESP_LOGE(LIFECYCLE_TAG, "nvs_flash_erase failed: %s", esp_err_to_name(err));
    }
}

static void clear_nvs_namespace(const char *namespace, const char *description) {
    if (namespace == NULL || description == NULL) {
        return;
    }

    ESP_LOGI(LIFECYCLE_TAG, "Clearing %s in NVS namespace '%s'", description, namespace);

    esp_err_t init_err = lifecycle_ensure_nvs_initialized(LIFECYCLE_TAG);
    if (init_err != ESP_OK) {
        ESP_LOGW(LIFECYCLE_TAG,
                 "Failed to initialise NVS while clearing namespace '%s': %s",
                 namespace,
                 esp_err_to_name(init_err));
        return;
    }

    nvs_handle_t handle;
    esp_err_t err = nvs_open(namespace, NVS_READWRITE, &handle);
    if (err != ESP_OK) {
        ESP_LOGW(LIFECYCLE_TAG, "Failed to open namespace '%s' for clearing: %s", namespace, esp_err_to_name(err));
        return;
    }

    err = nvs_erase_all(handle);
    if (err != ESP_OK) {
        ESP_LOGW(LIFECYCLE_TAG, "Failed to erase namespace '%s': %s", namespace, esp_err_to_name(err));
    } else {
        err = nvs_commit(handle);
        if (err != ESP_OK) {
            ESP_LOGW(LIFECYCLE_TAG, "Failed to commit erase of namespace '%s': %s", namespace, esp_err_to_name(err));
        }
    }

    nvs_close(handle);
}

static void clear_lcm_namespace(void) {
    clear_nvs_namespace("lcm", "Lifecycle Manager state");
}

static void clear_fwcfg_namespace(void) {
    clear_nvs_namespace("fwcfg", "firmware configuration");
}

static void erase_otadata_partition(void) {
    const esp_partition_t *otadata = esp_partition_find_first(
            ESP_PARTITION_TYPE_DATA, ESP_PARTITION_SUBTYPE_DATA_OTA, NULL);
    if (otadata == NULL) {
        ESP_LOGW(LIFECYCLE_TAG, "OTA data partition not found");
        return;
    }

    ESP_LOGI(LIFECYCLE_TAG,
            "Erasing OTA data partition '%s' at offset 0x%08" PRIx32 " (size=%" PRIu32 ")",
            otadata->label, otadata->address, (uint32_t)otadata->size);
    esp_err_t err = esp_partition_erase_range(otadata, 0, otadata->size);
    if (err != ESP_OK) {
        ESP_LOGE(LIFECYCLE_TAG, "Failed to erase OTA data partition: %s", esp_err_to_name(err));
    }
}

static bool erase_ota_partition_by_label(const char *label) {
    if (label == NULL) {
        return false;
    }

    bool erased = false;

    esp_partition_iterator_t it = esp_partition_find(
            ESP_PARTITION_TYPE_APP, ESP_PARTITION_SUBTYPE_ANY, NULL);

    while (it != NULL) {
        const esp_partition_t *part = esp_partition_get(it);
        esp_partition_iterator_t next = esp_partition_next(it);

        if (part != NULL && strncmp(part->label, label, sizeof(part->label)) == 0) {
            if (part->subtype >= ESP_PARTITION_SUBTYPE_APP_OTA_MIN &&
                    part->subtype <= ESP_PARTITION_SUBTYPE_APP_OTA_MAX) {
                ESP_LOGI(LIFECYCLE_TAG,
                        "Erasing OTA partition '%s' at offset 0x%08" PRIx32 " (size=%" PRIu32 ")",
                        part->label, part->address, (uint32_t)part->size);
                esp_err_t err = esp_partition_erase_range(part, 0, part->size);
                if (err != ESP_OK) {
                    ESP_LOGE(LIFECYCLE_TAG, "Failed to erase partition '%s': %s",
                            part->label, esp_err_to_name(err));
                } else {
                    erased = true;
                }
            } else {
                ESP_LOGW(LIFECYCLE_TAG,
                        "Partition '%s' found but subtype %d is not an OTA application",
                        part->label, part->subtype);
            }
        }

        esp_partition_iterator_release(it);
        it = next;
    }

    return erased;
}

static void erase_ota_app_partitions(void) {
    ESP_LOGI(LIFECYCLE_TAG, "Erasing OTA application partitions");

    const char *labels[] = {
        "ota_1",
        "ota_2",
        "ota_0",
    };

    bool any_erased = false;
    for (size_t i = 0; i < sizeof(labels) / sizeof(labels[0]); ++i) {
        bool erased = erase_ota_partition_by_label(labels[i]);
        if (!erased) {
            ESP_LOGW(LIFECYCLE_TAG, "OTA partition '%s' not found or already empty", labels[i]);
        }
        any_erased |= erased;
    }

    if (!any_erased) {
        ESP_LOGW(LIFECYCLE_TAG, "No OTA partitions were erased");
    }
}

