AchimPieters/esp32-smart-connect-plug/main/esp32-lcm.c
void lifecycle_factory_reset_and_reboot(void) {
    ESP_LOGI(LIFECYCLE_TAG, "Performing factory reset (HomeKit + Wi-Fi)");

    lifecycle_reset_restart_counter();

    bool factory_boot_selected = false;

    const esp_partition_t *factory = esp_partition_find_first(
            ESP_PARTITION_TYPE_APP, ESP_PARTITION_SUBTYPE_APP_FACTORY, NULL);
    if (factory == NULL) {
        ESP_LOGE(LIFECYCLE_TAG, "Factory partition not found, rebooting to current app");
    } else {
        lifecycle_log_step("set_boot=factory");
        esp_err_t boot_err = esp_ota_set_boot_partition(factory);
        if (boot_err != ESP_OK) {
            ESP_LOGE(LIFECYCLE_TAG, "Failed to select factory partition after reset: %s", esp_err_to_name(boot_err));
        } else {
            lifecycle_log_step("set_post_reset_flag=factory");
            lifecycle_mark_post_reset(LIFECYCLE_POST_RESET_REASON_FACTORY);
            factory_boot_selected = true;
        }
    }

    lifecycle_log_step("reset_homekit_store");
    homekit_server_reset();

    lifecycle_perform_common_shutdown(false);

    lifecycle_log_step("erase_wifi_credentials");
    erase_wifi_credentials();

    lifecycle_log_step("clear_fw_config");
    clear_fwcfg_namespace();

    lifecycle_log_step("clear_lcm_state");
    clear_lcm_namespace();

    lifecycle_log_step("erase_otadata");
    erase_otadata_partition();

    lifecycle_log_step("erase_ota_apps");
    erase_ota_app_partitions();

    lifecycle_log_step("restore_wifi_defaults");
    esp_err_t wifi_restore_err = esp_wifi_restore();
    if (wifi_restore_err != ESP_OK) {
        ESP_LOGW(LIFECYCLE_TAG, "esp_wifi_restore failed: %s", esp_err_to_name(wifi_restore_err));
    }

    erase_nvs_partition();

    lifecycle_log_step("delay_before_reset");
    vTaskDelay(pdMS_TO_TICKS(100));

    lifecycle_log_step("reboot");
    if (factory_boot_selected) {
        ESP_LOGI(LIFECYCLE_TAG, "Factory reset complete, rebooting into factory partition");
    } else {
        ESP_LOGI(LIFECYCLE_TAG, "Factory reset complete, rebooting current firmware");
    }
    esp_restart();
}
